/**
 *
 * Да се направи функција која за даден број на чекори `n` и низа од вредности, ќе ги поместува елементите кои се наоѓаат во неа следејќи ги следните правила:
 *
 * - Доколку `n` е ПОЗИТИВЕН број, тогаш секој од елементите во низата треба да ја промени својата позиција кон десно, за онолку места колку што изнесува `n`.
 *
 * - Доколку `n` е НЕГАТИВЕН број, тогаш секој од елементите во низата треба да ја промени својата позиција кон лево, за онолку места колку што изнесува `n`.
 *
 * Пример:
 *  - n = 2, низата ['1', '2', '3'] треба да се претвори во ['2', '3', '1']
 *  - n = -3, низата ['1', '2', '3', '4', '5'] треба да се претвори во ['4', '5', '1', '2', '3']
 */

const arr = ['1', '2', '3', '4', '5']

function moveElement(n) {


    if (Math.sign(n) === 1) {
        let moveEl = arr.splice(arr.length - n);

        for (let i = 0; i < n; i++) {
            arr.splice(i, 0, moveEl[i])
            console.log(`Step ${i + 1}`, arr)
        }
        console.log("POSITIVE-ARRAY", arr)


    } else if (Math.sign(n) === -1) {
        let positiveNum = Math.abs(n)

        let moveEl = arr.splice(0, positiveNum)

        arr.push.apply(arr, moveEl);

        console.log("NEGATIVE-ARRAY", arr)

    }

}

moveElement(-3)